bekencorp/armino/middleware/soc/bk7235m/soc/aud_struct.h
    /* REG_0x12 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dacl_port                      :16;  //0x12[15:0],DACL的FIFO写入地址,0,W
           volatile uint32_t  dacr_port                      :16;  //0x12[31:16],DACR的FIFO写入地址,0,W
        }; 
        uint32_t v; 
    }dacl_fport; 

    /* REG_0x13 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x13_reserved; 

    /* REG_0x14 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x14_reserved; 

    /* REG_0x15 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x15_reserved; 

    /* REG_0x16 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x16_reserved; 

    /* REG_0x17 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x17_reserved; 

    /* REG_0x18 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dac_fracmod_manual             : 1;  //0x18[0],DAC小数分频手动设置使能,0,RW
           volatile uint32_t  adc_fracmod_manual             : 1;  //0x18[1],ADC小数分频手动设置使能,0,RW
           volatile uint32_t  filt_enable                    : 1;  //0x18[2],DAC的频响滤波器使能,0,RW
           volatile uint32_t  reserved                       :29;  //0x18[31:3],reserved,0,R
        }; 
        uint32_t v; 
    }extend_cfg; 

    /* REG_0x19 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dac_fraccoef                   :32;  //0x19[31:0],DAC小数分频设置值 N * 2^24,0,RW
        }; 
        uint32_t v; 
    }dac_fracmod; 

    /* REG_0x1a */
    union 
    { 
        struct 
        { 
           volatile uint32_t  adc_fraccoef                   :32;  //0x1a[31:0],ADC小数分频设置值 N * 2^24,0,RW
        }; 
        uint32_t v; 
    }adc_fracmod; 

    /* REG_0x1b */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1b_reserved; 

    /* REG_0x1c */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1c_reserved; 

    /* REG_0x1d */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1d_reserved; 

    /* REG_0x1e */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x1e_reserved; 

    /* REG_0x1f */
    union 
    { 
        struct 
        { 
           volatile uint32_t  hpf2_a1_l6bit                  : 6;  //0x1f[5:0],DAC HPF2的系数A1低6比特,0,RW
           volatile uint32_t  hpf2_a2_l6bit                  : 6;  //0x1f[11:6],DAC HPF2的系数A2低6比特,0,RW
           volatile uint32_t  hpf2_b0_l6bit                  : 6;  //0x1f[17:12],DAC HPF2的系数B0低6比特,0,RW
           volatile uint32_t  hpf2_b1_l6bit                  : 6;  //0x1f[23:18],DAC HPF2的系数B1低6比特,0,RW
           volatile uint32_t  hpf2_b2_l6bit                  : 6;  //0x1f[29:24],DAC HPF2的系数B2低6比特,0,RW
           volatile uint32_t  reserved                       : 2;  //0x1f[31:30],reserved,0,R
        }; 
        uint32_t v; 
    }hpf2_ext_coef; 

    /* REG_0x20 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt0_a1                        :16;  //0x20[15: 0],Filter 0 的IIR系数A1,0,RW
           volatile uint32_t  flt0_a2                        :16;  //0x20[31:16],Filter 0 的IIR系数A2,0,RW
        }; 
        uint32_t v; 
    }flt0_coef_a1a2; 

    /* REG_0x21 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt0_b0                        :16;  //0x21[15: 0],Filter 0 的IIR系数B0,0,RW
           volatile uint32_t  flt0_b1                        :16;  //0x21[31:16],Filter 0 的IIR系数B1,0,RW
        }; 
        uint32_t v; 
    }flt0_coef_b0b1; 

    /* REG_0x22 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt0_b2                        :16;  //0x22[15: 0],Filter 0 的IIR系数B2,0,RW
           volatile uint32_t  reserved                       :16;  //0x22[31:16],reserved,0,R
        }; 
        uint32_t v; 
    }flt0_coef_b2; 

    /* REG_0x23 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt1_a1                        :16;  //0x23[15: 0],Filter 1 的IIR系数A1,0,RW
           volatile uint32_t  flt1_a2                        :16;  //0x23[31:16],Filter 1 的IIR系数A2,0,RW
        }; 
        uint32_t v; 
    }flt1_coef_a1a2; 

    /* REG_0x24 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt1_b0                        :16;  //0x24[15: 0],Filter 1 的IIR系数B0,0,RW
           volatile uint32_t  flt1_b1                        :16;  //0x24[31:16],Filter 1 的IIR系数B1,0,RW
        }; 
        uint32_t v; 
    }flt1_coef_b0b1; 

    /* REG_0x25 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt1_b2                        :16;  //0x25[15: 0],Filter 1 的IIR系数B2,0,RW
           volatile uint32_t  reserved                       :16;  //0x25[31:16],reserved,0,R
        }; 
        uint32_t v; 
    }flt1_coef_b2; 

    /* REG_0x26 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt2_a1                        :16;  //0x26[15: 0],Filter 2 的IIR系数A1,0,RW
           volatile uint32_t  flt2_a2                        :16;  //0x26[31:16],Filter 2 的IIR系数A2,0,RW
        }; 
        uint32_t v; 
    }flt2_coef_a1a2; 

    /* REG_0x27 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt2_b0                        :16;  //0x27[15: 0],Filter 2 的IIR系数B0,0,RW
           volatile uint32_t  flt2_b1                        :16;  //0x27[31:16],Filter 2 的IIR系数B1,0,RW
        }; 
        uint32_t v; 
    }flt2_coef_b0b1; 

