bekencorp/armino/middleware/soc/bk7235m/soc/aud_struct.h
    /* REG_0x28 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt2_b2                        :16;  //0x28[15: 0],Filter 2 的IIR系数B2,0,RW
           volatile uint32_t  reserved                       :16;  //0x28[31:16],reserved,0,R
        }; 
        uint32_t v; 
    }flt2_coef_b2; 

    /* REG_0x29 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt3_a1                        :16;  //0x29[15: 0],Filter 3 的IIR系数A1,0,RW
           volatile uint32_t  flt3_a2                        :16;  //0x29[31:16],Filter 3 的IIR系数A2,0,RW
        }; 
        uint32_t v; 
    }flt3_coef_a1a2; 

    /* REG_0x2a */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt3_b0                        :16;  //0x2a[15: 0],Filter 3 的IIR系数B0,0,RW
           volatile uint32_t  flt3_b1                        :16;  //0x2a[31:16],Filter 3 的IIR系数B1,0,RW
        }; 
        uint32_t v; 
    }flt3_coef_b0b1; 

    /* REG_0x2b */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt3_b2                        :16;  //0x2b[15: 0],Filter 3 的IIR系数B2,0,RW
           volatile uint32_t  reserved                       :16;  //0x2b[31:16],reserved,0,R
        }; 
        uint32_t v; 
    }flt3_coef_b2; 

    /* REG_0x2c */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt0_a1_l6bit                  : 6;  //0x2c[5:0],Filter 0 的IIR系数A1低6比特,0,RW
           volatile uint32_t  flt0_a2_l6bit                  : 6;  //0x2c[11:6],Filter 0 的IIR系数A2低6比特,0,RW
           volatile uint32_t  flt0_b0_l6bit                  : 6;  //0x2c[17:12],Filter 0 的IIR系数B0低6比特,0,RW
           volatile uint32_t  flt0_b1_l6bit                  : 6;  //0x2c[23:18],Filter 0 的IIR系数B1低6比特,0,RW
           volatile uint32_t  flt0_b2_l6bit                  : 6;  //0x2c[29:24],Filter 0 的IIR系数B2低6比特,0,RW
           volatile uint32_t  reserved                       : 2;  //0x2c[31:30],reserved,0,R
        }; 
        uint32_t v; 
    }flt0_ext_coef; 

    /* REG_0x2d */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt1_a1_l6bit                  : 6;  //0x2d[5:0],Filter 1 的IIR系数A1低6比特,0,RW
           volatile uint32_t  flt1_a2_l6bit                  : 6;  //0x2d[11:6],Filter 1 的IIR系数A2低6比特,0,RW
           volatile uint32_t  flt1_b0_l6bit                  : 6;  //0x2d[17:12],Filter 1 的IIR系数B0低6比特,0,RW
           volatile uint32_t  flt1_b1_l6bit                  : 6;  //0x2d[23:18],Filter 1 的IIR系数B1低6比特,0,RW
           volatile uint32_t  flt1_b2_l6bit                  : 6;  //0x2d[29:24],Filter 1 的IIR系数B2低6比特,0,RW
           volatile uint32_t  reserved                       : 2;  //0x2d[31:30],reserved,0,R
        }; 
        uint32_t v; 
    }flt1_ext_coef; 

    /* REG_0x2e */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt2_a1_l6bit                  : 6;  //0x2e[5:0],Filter 2 的IIR系数A1低6比特,0,RW
           volatile uint32_t  flt2_a2_l6bit                  : 6;  //0x2e[11:6],Filter 2 的IIR系数A2低6比特,0,RW
           volatile uint32_t  flt2_b0_l6bit                  : 6;  //0x2e[17:12],Filter 2 的IIR系数B0低6比特,0,RW
           volatile uint32_t  flt2_b1_l6bit                  : 6;  //0x2e[23:18],Filter 2 的IIR系数B1低6比特,0,RW
           volatile uint32_t  flt2_b2_l6bit                  : 6;  //0x2e[29:24],Filter 2 的IIR系数B2低6比特,0,RW
           volatile uint32_t  reserved                       : 2;  //0x2e[31:30],reserved,0,R
        }; 
        uint32_t v; 
    }flt2_ext_coef; 

    /* REG_0x2f */
    union 
    { 
        struct 
        { 
           volatile uint32_t  flt3_a1_l6bit                  : 6;  //0x2f[5:0],Filter 3 的IIR系数A1低6比特,0,RW
           volatile uint32_t  flt3_a2_l6bit                  : 6;  //0x2f[11:6],Filter 3 的IIR系数A2低6比特,0,RW
           volatile uint32_t  flt3_b0_l6bit                  : 6;  //0x2f[17:12],Filter 3 的IIR系数B0低6比特,0,RW
           volatile uint32_t  flt3_b1_l6bit                  : 6;  //0x2f[23:18],Filter 3 的IIR系数B1低6比特,0,RW
           volatile uint32_t  flt3_b2_l6bit                  : 6;  //0x2f[29:24],Filter 3 的IIR系数B2低6比特,0,RW
           volatile uint32_t  reserved                       : 2;  //0x2f[31:30],reserved,0,R
        }; 
        uint32_t v; 
    }flt3_ext_coef; 

} aud_hw_t;

#ifdef __cplusplus 
}                  
#endif             
